# Create DataFrame

A pandas DataFrame can be created using various inputs like âˆ’

    1. Lists
    2. dict
    3. Series
    4. Numpy ndarrays
    5. Another DataFrame

In [1]:
import pandas as pd

In [2]:
# Create an Empty DataFrame
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [3]:
# Create dataFrame from list
list=[1,2,3,4,5]
df=pd.DataFrame(list)
print(df)

   0
0  1
1  2
2  3
3  4
4  5

In [4]:
#create a DataFrame from list of list
list=[['raj',72],['Meen',65],['Aarohi',15],['Aarushi',10]]
df=pd.DataFrame(list,columns=['name','Weight'],index=['Father','Mother','Child1','Child2'])
df

           name  Weight
Father      raj      72
Mother     Meen      65
Child1   Aarohi      15
Child2  Aarushi      10

In [5]:
# Craete DataFrame from Dictionary
Dict={'Name':['Rajendra','Meenakshi','Aarohi','Aarushi'],
      'Weight':[74,65,15,10]}
index = ['Father','Mother','Child1','Child2']
df=pd.DataFrame(Dict,index)
df

             Name  Weight
Father   Rajendra      74
Mother  Meenakshi      65
Child1     Aarohi      15
Child2    Aarushi      10

In [6]:
# Create DataFrame from Dictionary of Series Object
data={ 'one':pd.Series([10,20,30], index=['a','b','c']),
       'Two':pd.Series([100,200,300,400],index=['a','b','c','d']) }
df=pd.DataFrame(data)
df

    one  Two
a  10.0  100
b  20.0  200
c  30.0  300
d   NaN  400

In [7]:
# Create DataFrame from ndarray
import numpy as np
arr=np.arange(12).reshape(4,3)
df=pd.DataFrame(arr,columns=['col1','col2','col3'],index=['row1','row2','row3','row4'])
df

      col1  col2  col3
row1     0     1     2
row2     3     4     5
row3     6     7     8
row4     9    10    11

In [8]:
# adding a new column by passing as series
df['col4']=pd.Series([12,13,14,15],index=['row1','row2','row3','row4'])
df

      col1  col2  col3  col4
row1     0     1     2    12
row2     3     4     5    13
row3     6     7     8    14
row4     9    10    11    15

In [9]:
#adding a new column by using existing columns
df['col5']=df['col2']+df['col3']
df

      col1  col2  col3  col4  col5
row1     0     1     2    12     3
row2     3     4     5    13     9
row3     6     7     8    14    15
row4     9    10    11    15    21

In [10]:
# Deleting the fifth column using DEL function
del df['col5']

In [11]:
df

      col1  col2  col3  col4
row1     0     1     2    12
row2     3     4     5    13
row3     6     7     8    14
row4     9    10    11    15

In [12]:
#Deleting the fourth column using pop function
df.pop('col4')

row1    12
row2    13
row3    14
row4    15
Name: col4, dtype: int64

In [13]:
df

      col1  col2  col3
row1     0     1     2
row2     3     4     5
row3     6     7     8
row4     9    10    11

In [14]:
# One Column Selection
df['col1']

row1    0
row2    3
row3    6
row4    9
Name: col1, dtype: int32

In [15]:
# more than one Column selection
df[['col1','col3']]

      col1  col3
row1     0     2
row2     3     5
row3     6     8
row4     9    11

In [16]:
df

      col1  col2  col3
row1     0     1     2
row2     3     4     5
row3     6     7     8
row4     9    10    11

In [17]:
#Row selection using loc
df.loc['row2']

col1    3
col2    4
col3    5
Name: row2, dtype: int32

In [18]:
# OR
df.iloc[1]

col1    3
col2    4
col3    5
Name: row2, dtype: int32

In [19]:
# OR
df.iloc[1:-2]

      col1  col2  col3
row2     3     4     5

In [20]:
# Specific cell value
df.loc['row2','col3']

5

In [21]:
# OR
df.iloc[1,2]

5

In [22]:
df

      col1  col2  col3
row1     0     1     2
row2     3     4     5
row3     6     7     8
row4     9    10    11

In [23]:
df.col2.max()

10

In [24]:
#OR
df['col2'].max()

10

In [25]:
df['col2'].min()

1

In [26]:
df['col2'].std()

3.872983346207417

In [28]:
df['col2'].count()

4

In [29]:
df['col2'].sum()

22

In [30]:
df['col2'].mean()

5.5

In [31]:
df['col2'].mode()

0     1
1     4
2     7
3    10
dtype: int32

In [32]:
df['col2'].median()

5.5